{"intents": [
        
        {"tag": "confused",
         "patterns": [],
         "responses": ["Sorry, kindly rephrase the question","Sorry, can not understand you", "Please give me more information", "Not sure I understand"],
         "context": [""]
        },
	
	{"tag": "Leave_Letter_Email",
         "patterns": ["Leave of Absence Request", "Medical Leave of Absence Request Letter", "Annual leave application", "Maternity leave application","Paternity leave application","Casual leave application","Sick leave application","Leave application due to the illness of family member","Leave required due to death in the family","Personal Leave Application for a Day","Leave email Application for Half a Day","Leave Email for my wedding","Bereavement leave application on the demise of my relation with the family member/friend","Emergency leave application email"],
         "responses": ["Dear ABC,\n I would like to request a XXX days leave of absence for personal reasons. If possible, I would like to leave work on DDMMYYYY and return on DDMMYYYY. \n If approved, I will be traveling during this time period, but I would be glad to assist with any questions via email or phone. \n Thank you very much for your consideration. \n Sincerely, \n XYZ","Dear ABC,\n I would like to request a leave of absence for medical reasons. I will be having hernia surgery on DDMMYYYY and expect to return to work approximately WW weeks later.\n I can provide written documentation from the surgeon, if necessary. \n Thank you very much for your consideration. \n Sincerely, \n XYZ","Dear ABC, \n I am writing this letter to let you know that I am in need of a long-term leave. Thus, I would like to avail my full annual leave allotment as I have my complete yearly leave allowance. \n I request you to consider my leave application of DD days as I am planning for an international vacation with my family. I would like to avail the leaves from start date to end date. \n I have delegated my current project to person name. He/she very well understands about my project and is capable of handling the task without any difficulties. In fact, it is only the final part that is left to be carried out by him/her. \n During the days of my absence from office, I can be reached at email address and contact number. \n I will return to the office on DDMMYYYY . In case I want to resume the work sooner or later than the stated date, I will let you know well in advance. \n Yours Sincerely, \n XYZ","Dear Recipient Name, \n I hope that this letter finds you in the best of health. This letter concerns my request regarding maternity leave from {start date} to {end date}. It is going to be a three-month leave, and I will rejoin soon after that. \n As I am going to be away for a very long time, I have authorized {name of the person} to take over my responsibilities. He/she has courteously agreed to take over my chair for DD days. \n I have attached my medical certificate, along with other important details, required to avail the leave. \n I also request you to give me the information of the hospital covered under the office insurance coverage so that a part of my medical expenses is taken care of. \n In the case of an emergency, please contact me at {your contact information}.\n Yours Sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this letter to let you know that my wife is in the final stage of her pregnancy and the due date is fast approaching. \n Since this is going to be our first baby, I am way too excited to see my child and desire to be with her during the delivery and a couple of weeks post the delivery. \n As we stay alone and my parents are going to join us in a few weeks, I request you to grant me leave for 30 days, beginning from the {date}.\n I have transferred the important duties to my associate {name of the person}, and he/she will look after the tasks until I get back to work. \n I hope you understand my situation and authorize my paternity leave as soon as possible. \n Thanks and regards, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this application to request for seven days leave. The reason for my week-long leave is that I have to attend a telecommunication conference from {start date} to {end date}.\n This is an essential conference as I would encounter many new and advanced technologies that we could use to update our telecom system. I will be very interested in attending this conference to learn about the revolutionary aspects of the telecommunication industry. With the conference, there will likely be a two-day workshop in which I will learn and observe the things practically. \n As this conference is in Frankfurt, I will have to leave early on the evening of {date} to be in time at the airport. \n I shall be resuming office on {date} afternoon. I will be grateful to you for considering my leave application. \n Sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing to notify you that I need sick leave from work because of a severe viral infection. I caught the infection yesterday evening and since then have been feeling very weak. \n As per the doctor, I need to take medication for five days, along with proper rest for at least a week. The letter from the doctor is attached, confirming the need of time to recover from the illness. \n Kindly allow me a week-long leave, until the {date}. Should I require an extended period off, I will let you know as early as possible. \n Please feel free to contact me at your convenience, should you have any questions or require clarification concerning the ongoing project. \n Thank you for your quick attention to this matter. \n Sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this letter to let you know about my requirement for an important and unexpected leave. This is because of an emergency in the family. \n We have just got the news that my sibling has been diagnosed with dengue. I will be quickly heading to the hospital to be with her and look after the family. \n I plan to return to work next week on {date}. I feel confident that my current projects are not going to suffer from such a quick absence and that my work record speaks for itself as much as my ability to make up for lost time. \n I appreciate your support in this matter and anticipate hearing a response from you. \n Yours sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this letter to inform you about the unfortunate and unexpected passing away of my uncle today. I intend to leave tonight and be out of town for the funeral and related arrangements until {date}.\n I request you to grant me seven days of emergency leaves because of such circumstances. \n I trust that my work over the last few years speaks for itself about my willingness to make all endeavors to catch up satisfactorily upon my return. \n I am confident that my current unfinished tasks will not be negatively affected by this short absence. \n Once I return to the office on {date}, I hope to be able to concentrate on my work much more effectively. \n Thank you for your support during this time. \n Yours sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this letter to inform you that I need to take a day of absence on the {date} of this month. I will be accompanying my mother for an appointment with her doctor. I will be back in the office the next day in the morning without fail. \n You can contact me at my number in case of questions or clarifications. I have emailed you a copy of the work plan for the day I plan to take leave. I am sure the team will handle everything perfectly during my absence. \n I apologise for any inconvenience caused due to my absence and hope that you will understand my situation. \n Sincerely, \n ABC","Dear Mr./Mrs. {Recipient Name},\n I am writing this letter to inform you that I will not be able to come to work on time on {Date} as I have an appointment with my dentist. Since the appointment is in the morning, I will come to the office around XX PM and try to get as much work done as possible. \n I am sure the team will handle everything exceptionally. Please contact me if you have any doubts or queries about the current project. \n Sincerely, \n ABC","Dear Mr. ABC, \n I am glad to inform you that I am getting married on the DD/MM/YYYY at XYZ Park, City. \n I am writing to you to request some time off as I enter this new phase of my life. \n I would like to apply for a leave from Start Date to End Date. \n Through this mail, I would also like to extend an invitation to all my colleagues. \n You can find the invitation attached below. \n I will make sure that I meet my deadlines by DDMMYYYY, and give a proper handover to XYZ to take care of any urgency in my absence. \n I hope you will accept my request and grant me leaves for the said dates. \n Looking forward to your positive reply. \n Regards, \n DEF","Dear Mr. ABC, \n I regret to inform you that my grandmother passed away today, tragically and unexpectedly. In light of these circumstances, I respectfully request that you grant me DD days of paid leave and DD days of unpaid leave beginning today. \n I am heading home today, DDMMYYYY, and will be out of town for the funeral and other arrangements until DDMMYYYY. \n I will be back in the office on DDMMYYYY, positively. I would appreciate your concern in this matter, as I will need this time to take care of my family. \n In case you need me, please leave me a message on my number. You can also reach me at (XXX) 20XX XXXX. \n Thank you for your consideration. \n Yours sincerely, \n XYZ","Dear (Recipient Name) \n It is with regret that I need to request an emergency leave starting today. As the nature of the leave is that they are unpredictable, I feel sorry that I am unable to provide you with more than one day of notice. \n My sister met with an accident a few hours back, and she has been hospitalized in an emergency. I am required to be present at the hospital, along with my parents in Bangalore. I anticipate having most of my immediate issue to take taken care of within a week and hope to join office back on DDMMYYYY. \n Please reach to me in case of any emergencies and queries regarding work at my email id ( email address) and my phone number ( contact number). You can also contact (colleague name) for any work related discussions as she is aware of the ongoing project and tasks related to it. \n Yours Sincerely, \n (Your Name)"],
         "context": [""]
        },
        {"tag": "Business_Letter",
         "patterns": ["Apology Letters", "Thank you note for charitable contributions", "Thank you note for team leadership on a project", "Business Thank You Letters", "Candidate Rejection Letter", "Congratulation Letter", "Resignation letter", "Email Notification of Absence", "Email Excuse with Documentation", "Advanced Notice Absence Excuse Email", "Formal Sickness Excuse Letter", "Offer of Assistance to a Family for a Sick Employee", "Sample Complimentary Letter to Employee on Handling of Emergency", "Reply to an Employee request to change working hours", "Company Bonus Letter", "Sample Notice to Employees for New Vacation Policy", "Employment Verification Template", "Employment Verification for Current Employee", "Employment verification for past Employee", "Departure Sample", "Moving On", "Research Inquiry Letter", "Real Estate Inquiry Letter", "Inquiry Letter for company", "Inquiry letter after interview", "Congressional Inquiry Letter", "Credit Inquiry Explanation Letter", "Credit Report Inquiry Letter", "Formal appreciation letter", "Semi-formal appreciation letter", "Casual letter of appreciation", "Business thank you letters"],
         "responses": ["Dear abc, \n I am very sorry for my behavior in the staff meeting this morning. I cut you off in the middle of your presentation and criticized your performance in front of the staff. This was not only unprofessional but also simply disrespectful. I let my stress about a personal matter impact my management of the office. \n I have always said to you, and to all my employees, that I want this office to be a place where you all feel comfortable sharing ideas with one another. When I yelled at you publicly for a small error in your presentation, I damaged that collaborative environment. \n I am taking steps to make sure I do not lose my temper in that way again. I am working to manage my stress so that I do not let it impact the way I interact with my employees. I also know how capable you are of conducting a terrific staff meeting. I would, therefore, love for you to lead the staff meeting next week. \n I am very sorry again. Feel free to contact me if you would like to discuss this matter further. \n Sincerely,\n xyz", "Date \n  Dear abc, \n Your effort on behalf of the Boys and Girls Club to engage our staff in a worthwhile charitable event is noteworthy. Your participation in the organization of the silent auction, the buffet appetizers, the cocktail hour, and locating speakers provided our company with significant positive press in the local community. \n When my wife and I attended the event, several people thanked me for providing company resources to assist with the event. Your time and commitment stand out, but you also recruited 15 other staff members. Everywhere we went at the event, our staff was helping due to your recruiting and commitment to the charitable cause. \n Our employees were parking cars, delivering and recording silent auction wins, greeting guests, running the coat check, and more. The company logo on their sweaters was a nice touch, too, as all attendees saw the level of support that we provided at the event due to your charitable contributions. \n It feels good to know that your efforts set a fund raising record for the club. I wanted to take the time to tell you that we deeply appreciate your charitable contributions of time, energy, and talent to such a worthy cause on our behalf. \n Thank you. \n xyz \n On Behalf of Your Executive Team \n cc: Executive Team", "Dear abc, \n Thank you for your outstanding job leading the web redesign project. The project met its goals and serves as an example for the company about how a project team can set goals, obtain support from the organization, and accomplish its stated goals and mission within the projected time frame. \n At our wrap-up luncheon today, you recognized each member of your team in a thoughtful, deserving way. \n I am certain that your team members feel rewarded and recognized. I was happy to add my voice to yours in praising the team effort. \n You provided a lesson that all of us can learn from about how to make a team successful in our company. I’d like you to share your observations and thoughts at the upcoming monthly manager meeting. Please let me know if you can be prepared by then and if there is any way that I can help you present your key learnings and process. \n Again, I am so happy with the contribution that you have made to our organization through your leadership of the web redesign team. I hope to make use of your leadership skills in the future. \n Thank you. \n Xyz","Abc \n Street name \n pin code \n phone number \n Date \n Name of the receiver \n Position of the receiver \n Street name \n pin code \n phone number \n Dear receiver, \n It was a pleasure to meet with you regarding the marketing manager position with your firm. After hearing about the new direction you are planning to take with your marketing division, especially the plans to incorporate more interactive media, I am even more confident that I would be very interested in joining your group. My background includes strong experience in social media and web development, and I have some great ideas already to help with the rebranding. \n Thank you for taking the time to meet with me. I will be in touch later this week to follow up with you, but please don not hesitate to contact me at your convenience with any additional questions. I look forward to speaking with you soon. \n Regards, \n Signature (hard copy letter) \n abc","Dear Mr./Ms. Last name,\n Thank you for your application for the [insert your job position title] at [insert your company’s name]. We really appreciate your interest in joining our company and we want to thank you for the time and energy you invested in your [insert applicable: job application/job assignment]. \n We received a large number of [insert applicable: job application/job assignment], and after carefully reviewing all of them, unfortunately, we have to inform you that this time we will not be able to invite you to the next phase of our selection process. \n Though your [insert applicable: education/qualifications/working experience/skills] are impressive, we have decided to move forward with a candidate whose [insert applicable: education/qualifications/working experience/skills] better meet our needs for this particular role. \n We truly appreciate your expertise in [insert applicable industry] and interest in our company. We hope you will keep us in mind and apply again in the future. \n If you have any questions or need additional information, please don not hesitate to contact me by email [insert your email address] or phone [insert your phone number]. \n We wish you every personal and professional success in your future endeavors. \n Once again, thank you for your interest in working with us. Kind regards, \n [insert your first name and last name] \n [insert your job position title] \n [insert your company name]", "From, \n abc \n Street name \n pin code \n phone number \n Date \n To, \n xyz \n Street name \n pin code \n phone number \n Subject: Congratulation letter \n Dear Sir, \n We are writing this letter to congratulate you on your engagement. We recently got the news that you got engaged and that happy news made us write this letter to you. I thank god that I got your contact and was lucky enough to congratulate you on writing this letter. We are happy for you as you finally found a perfect mate for you. \n You were well settled, and the sole thing incomplete in your life was a life partner. Now, as that too has been fulfilled, I am very happy and glad. We wish you a very happy married life and wish you success in your life ahead. At the end of this letter, I would like to wish you all the very best. May God bless you with loads of happiness in career and your future. \n Thanking You \n Yours truly, \n abc", "Dear Ms xyz, \n I am writing to submit my resignation for my position as unit coordinator at Town Hospital, effective June. \n I am more grateful than I can say for all your support and assistance over the past five years. Working here has been a first-class education in teamwork, healthcare administration, and getting the job done. I will miss working with you all, and hope you will stay in touch. \n Please let me know if I can be of any assistance during the transition. \n Sincerely, \n abc \n email \n phone number", "Dear Mr abc, \n Please accept this written notification of my absence on DDMMYYYY. I am unable to attend work due to sickness. \n If you need additional information, please let me know. \n Sincerely, \n xyz", "Dear abc, \n I am writing to document my absence due to illness on DDMMYYYY. I was unable to report to work due to an acute attack of food poisoning. Please see the attached report of my treatment at Urgent Care. \n Regards, \n xyz", "Dear Supervisor Name: \n I have come down with the flu and will not be coming in on Monday, DDMMYYYY, so I can rest and recover. I have asked Patricia to check on my clients to ensure all of their needs are met, and Tom will prepare the report for our meeting Friday. \n I will try and check email if you need anything urgent. \n Thank you, \n xyz", "Your Name \n Title \n Organization \n Address \n City, State Zip Code \n Date \n Contact Name \n Title \n Organization \n Address \n City, State \n Zip Code \n Dear Mr. Lastname, \n Please accept this letter as documentation of my absence from DDMM through DDMMYYYY, due to sickness. I have included my doctor note detailing his recommendation for hospital treatment due to complications from the flu. I have also enclosed the hospital discharge instructions. \n If I can provide any additional information, please let me know. Thank you for your understanding. \n Sincerely, \n Your Signature (hard copy letter) \n Your Typed Name", "Dear (name of recipient) \n We would like to inform you that everyone here at (name of company) felt sad after learning that (name of employee) is ill for the past few days. \n Of course, we understand that this situation manifest without any warning and while the expected proceeds from the insurance coverage policy defrays a certain amount of the total medical costs, we know that you need additional cash assistance to overcome this difficult time in life. \n Please do not ever hesitate to contact us in case you need our financial assistance. We always consider (title – Mr./Ms./Mrs.)(name of employee)as one of the most valuable workers in this company and (he/she) is a fine individual and we will appreciate if you let (him or her) know that we are here praying for (his or her) fast recovery. \n Likewise, we will have you in following up the proceeds on the best we can.", "[Date] \n Dear [Name of Employee], \n We would like to commend you on how you handled the emergency situation on [date] when the program that was supposed to be passed on the same day experienced a problem. \n You were the one leading the team to fix the problem with only 1 hour left before the submission. You saved the company on this huge project and it was all because of your skills and knowledge. \n We are very proud that you are in this organization and we are expecting that you will do the same thing when a sudden emergency erupts. \n Sincerely, \n [Name of Sender] \n [Title] \n [Email]", "[Business Address] \n [Employee Address] \n [Today date] \n Dear [First Name] \n Thank you for your letter dated [insert date] regarding your request to change your working hours to fall in line with school term times. [or other reason] \n Following a meeting between [detail who made the decision] on [date] they agreed to accept your request to change your working hours to a term time working pattern with the following two caveats: \n [the following two bullet points are examples only, replace them with your own] \n You are to work a minimum of [time] during the main school Summer holiday period. \n Annual Leave can only be taken in school holidays. \n These new working hours will begin on [date] for a trial period of six months when the matter will be reviewed again on [date 6 months from this date]. \n Due to the reduction in working hours your salary and associated benefits will be affected. Your salary will be [details here], your holiday entitlement has been adjusted to [number of hours] and your pension contributions will be [amount]. [Mention any other changes to working terms here]. \n I hope you find the above terms agreeable. Please can you let me know if you are happy with them and I will begin the process of arranging for the necessary agreement to be drawn up. Please don not hesitate to contact me if you wish to discuss the matter further. \n Yours faithfully \n [Your Name] \n [Position]", "To all staff, \n CHRISTMAS BONUS \n We are delighted to let you know that this year we will be awarding all staff a Christmas bonus of [amount]. \n This bonus give us the opportunity to thank each and every one of you for your hard work this year. [Year] has been a challenging year and your hard work and dedication make us proud to have you work for us. \n Here is hoping next year with your help, we will see the company continue to grow. \n Season Greetings. \n [Name of company owner]", "[Date] \n Dear [Employee Name], \n This letter is made to inform you about the new company policy of [Name of Company] with regard to vacations. \n If you are going to ask for a vacation, it must be given to the company no less than 3 days prior to your target date. This new policy will enable the company to seek temporary help, if needed and to schedule vacations to other employees in a manner that will not affect the daily operations of the company. \n We would like to ask your full cooperation on the new policy. Thank you. \n Sincerely, \n [Name] \n [Title]", "Name \n Job Title \n Company Name \n Address \n City, State Zip Code \n Date \n Name of Person Requesting Verification \n Job Title \n Company Name \n Address \n City, State Zip Code \n Dear Mr./Ms. Last Name, \n This letter is to verify that (employee name) has been employed at (company name) since (start date). \n If you require any additional information regarding (employee name), please feel free to contact me at (your phone number). \n Sincerely, \n (Handwritten Signature) \n Your Name", "[name] \n [position] \n [address] \n DDMMYYYY \n [name] \n [position] \n [address] \n Dear Mr. ABC, \n This letter is to verify that ABC has been employed at GMC Associates for the past three years in our Accounting Department. She began work on DDMMYYYY. \n If you require any additional information, please feel free to contact me at [PHONE NUMBER]. \n Sincerely, \n (Handwritten Signature) \n XYZ \n [POSITION]", "ABC \n Human Resources Manager \n [ADDRESS] \n DDMMYYYY \n XYZ \n Manager \n [ADDRESS] \n Dear Ms. Sanchez, \n This letter is to verify that Robert Smith was employed at Martin & Martin, Incorporated from DDMMYYYY to DDMMYYYY. \n If you require any additional information regarding Robert Smith, please feel free to contact me at [PHONE NUMBER]. \n Sincerely, \n (Handwritten Signature) \n ABC", "Dear all \n I would like to take this opportunity to let you know that I will be leaving my position at ABC Company. My departure will be on DDMMYYYY. My family and I will be moving to city name since my wife were offered a new position at a distinguished hospital there. \n I would like to thank each of you for every experience shared, friendship made and the good times we had together. I would like all of you to know that working alongside you was very rewarding and i really appreciate all the help you have extended to me through tough times. It makes me wish that I had the chance to work with you more. Words are not enough to express my gratitude but i pray that one day our paths can cross again in future. \n It doesn not mean that am saying goodbye forever. You can still reach me at my personal email at (EMAIL) or my cell phone, [NUMBER]. \n Thank you again and wish the company more success. \n Sincerely, \n Mr. John James", "Dear XYZ, \n I would like to let you know that I am leaving my position at BDE Corporation on July 1st. \n I have enjoyed my tenure at BDE, and I appreciate having had the opportunity to work with you. Thank you for the support and encouragement you have provided me during my time at BDE. \n Even though I will miss my colleagues, clients, and the company, I am looking forward to starting a new phase of my career. \n Please keep in touch. I can be reached at my personal email address [email] or my cell phone [number]. You can also reach me on LinkedIn [profile name]. \n Thanks again. It is been a pleasure working with you. \n Best regards, \n ABC", "Name/Title \n Address \n City, State, Zip Code \n Subject: Inquiry regarding my research \n Respected [Name] \n I am currently studying in XYZ Business School Pursuing my MBA, I am in second year and have to give presentation on marketing field. \n I have read about your company on website and would like to do research on your company. I want to know about the marketing process. Therefore, I request you to give me one day permission of visiting your company and allow me to inquire about the marketing process. \n I would be grateful if you give me a chance to conduct the research. Please let me know about your reply at the earliest. \n Thanking you, \n ABC", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Subject: Inquiry regarding the purchase of real estate \n Respected [Name] \n This letter is in regards to inquiry about your new project in your real estate. \n I am planning to buy three bedrooms apartments for investment purpose. My budget for the same would be around [amount]. I would like to know if you have any project which is in my budget. Also know my other option for investment purpose. \n It would be really grateful if you can let me know the details or forward me your company brochure. I can also meet you personally if required. You van contact me on xxxxxxxxxx. \n Thanking you, \n abc", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Subject: Inquiry about a computer \n Respected [Name] \n This letter is to inquire about the HP Laptop. I am planning to buy ten laptops for my business purpose. \n We are advertising firm and would require laptop with graphic features. Our budget for ten laptop is Rs………. We would be requiring laptop which is easy to carry, portable, good ram sizeand most important which suits our budget. \n I would like to know the varieties of laptop with all the features that I have mentioned above. If required I am fine with any other brand too. \n  Regards, \n Abc", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Subject: Inquiry about my interview \n Respected [Name] \n This is in regards to my interview that was held in your ABC Company on DDMMYYYY for the position of [position name]. \n I thank you for giving me the opportunity to attend the interview. During my interviewi was told by Mr.XYZ that I will be informed about the result in one week whether I am selected or rejected. This job is very important for me and I am very sure about my selection as my interview was goog. \n I would request you to please let me know my result at the earliest. You can contact me on [phone number]. \n Yoyrs sincerely, \n ABC", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Respected [Name], \n This is to enquire about our [name of person] who has been convicted by you. \n Our [person name] is been convicted for murdering an [citizen name] and been imprisoned. This is to inform you that [name of the person] is in our army from last two year and is from good background. He is one of the brave soldiers in our army. He has proved his bravery by fighting in [place name]. \n As per our enquiry [person name] was tying to protect a girl from boys who were harassing her. For his own defence he tried to push the victim away from the girl and during the course the victim met with accident. \n Therefore, I would request you to look into the matter and let me know for what [person name] is been convicted. \n Regards, \n [XYZ]", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Subject: Letter for credit inquiry \n Respected [Name] \n This letter is regards to home load application. We have gone through the details of your income and the home loan amount that you want. We can approve your loan after check your credit rating. \n It is bank policy to check for the credit rating of the person applying for the loan, of the credit rating is positive than we can issue you the loan and if it is negative than we have to reject the application. We have to check the person is credit worthiness and credit rating maintained by various credit bureau. \n I hope you understand that this inquiry is a standard procedure and cooperate with us. Please collect all the needed documents and meet our representative at the office. \n Regards, \n ABCZ", "Date DDMMYYYY \n Name/Title \n Address \n City, State, Zip Code \n Subject: Inquiry credit report \n Respected [Name] \n This is in regards to my inquiry about the credit report that is with the credit rating agency. \n Last month I had inquired about my credit rating since I wanted to apply for the home loan. On my inquiry I was been informed that my credit rating is excellent. Therefore I had applied for the home loan with the bank, but my loan was rejected on the basis that my credit rating is not good. \n I would request you to look into the matter and I am also sending you a copy of my statement that I have got from credit rating agency last month which shows my records were excellent. \n Thanking you, \n ABC", "Dear [employee name], \n I would like to formally and sincerely express my gratitude for the amazing work you accomplished [insert what the employee did that deserves recognition]. \n Your [insert the employee admirable qualities that directly contributed to their achievement] are impressive and show exceptional discipline and dedication to this company. \n Your actions directly impacted the company by [insert how the employee actions benefited the team or company on a greater level]. I want you to know that I value the amount of effort you have put into your work. You are significantly appreciated as a part of this team. \n Once again, thank you for your hard work. I look forward to seeing your future achievements and successes! \n Sincerely, \n [Your first and last name] \n [Your job position title] \n [Your company name]", "Dear [employee name], \n I want to thank you for the amazing work you did with [insert what the employee did that deserves recognition]. \n Your [insert the employee admirable qualities that directly contributed to their achievement] shows just how disciplined you are and how much you care about this team. \n Your work led to [insert how the employee actions benefited the team or company on a greater level]. I want you to know you are valued on this team. We are so lucky to have you! \n Thanks again for all your hard work. I can not wait to see your future achievements and successes! \n Sincerely, \n [Your first and last name]", "Hi [employee name], \n I just wanted to say thanks for your help with [insert what the employee did that deserves recognition]. \n Your [insert the employee admirable qualities that directly contributed to their achievement] clearly showed! \n The time and effort you put in [insert how the employee actions benefited the team or company on a greater level]. We truly could not have done it without you! \n Thanks again! \n [Your first name]", "Dear [name], \n On behalf of Fixing Industries, I would like to say thank you for being a loyal customer. It has been a pleasure serving you and supplying you with consumer durable items, and we hope that we can have the pleasure of serving you for many more years to come. \n Fixing Industries is committed to providing our customers with the highest quality of consumer durable items through flawless customer service. \n As proof of our appreciation for your loyalty and ongoing support, we would like to give you a 15 percent voucher off your next purchase with us. \n Once again, thank you for your support, and we look forward to serving you in the coming months. \n Best regards, \n [name]"],
         "context": [""]
	},
	{"tag": "Employee_Letters",
	 "patterns": ["Employee letter", "Excuse letters", "Goodbye Letters","Late for work apology letter", "Mistake at work apology letter", "Salary reduction letter"],
 	 "responses": ["Subject Line: Departmental Changes \n Dear Team: \n Good morning. There are some exciting changes coming to our department that I wish to alert you to. \n Due to ABC Inc recent acquisition of XYZ Company, our executive management has decided that some restructuring of our department is in order so that our transition through this merger can be as seamless as possible. \n This is, in general, very good news for all of us, for we will be onboarding ten new sales representatives – which will both relieve our current understaffing situation and prepare us for the heightened sales operations this merger is anticipated to trigger. \n I am scheduling a staff meeting for tomorrow from 12 pm to 1 pm where I will outline the steps of this important transition; lunch will be provided. Please feel free to reach out to me at any time during the next few weeks with any questions or concerns. \n Best regards, \n ABCD \n Email: email@gmail.com \n Phone: xxxxxxxxxx", "Date: \n From, \n (name) \n (designation) \n (address) \n To, \n (name) \n (designation) \n (address) \n Salutation (Dear Mr./ Mrs. ABC), \n Subject: (Must be direct/straight forward) \n Body of Letter: (Be precise and to the point. Ensure that letter is professional, adopting all conventions of formal letter writing. Also do not forget to attach supporting documents if required) \n Complimentary Close (eg: Yours Sincerely) \n Signature line (Your name along with the title) \n Enclosures if any (Such as doctor note)", "ABC \n [address] \n [pin code] \n [phone number] \n email@email.com \n DDMMYYYY \n XYZ \n [Designation] \n [Address] \n Dear XYZ, \n I wanted to drop you a line personally to let you know that I will be leaving LMK at the end of the month. I am sorry to go, but as you know, I will be starting school in August and I want to give my studies my undivided attention. \n I have learned so much during my time here, and you have been a big part of that. I want to thank you for your mentorship and guidance when I was an intern and your support during my search for the right graduate program. \n Please keep in touch. My email address is email@email.com and my phone number is 555-555-5555. Let get coffee sometime during the coming semester and you can tell me all the news about the best team in the business. \n Thanks, and best regards, \n ABC (signature for hard copy)", "ABC \n [address] \n [pin code] \n [phone number] \n email@email.com \n DDMMYYYY \n XYZ \n [Designation] \n [Address] \n Dear Ms. XYZ, \n I am extremely sorry for my late arrival at the important sales meeting with The Star Agency last week. My tardiness almost lost us a valuable client. \n I understand that, as a sales team, we need to always present ourselves as professional and reliable, and timeliness is a large part of that professionalism. I, therefore, let down the entire sales team with my behavior. \n I am currently taking steps to ensure that I am never late again for a client meeting (or any other work-related event). I was delayed due to my car breaking down, so I am getting my car serviced. From now on, I will also be sure to leave for meetings even earlier than I already do, so even in the case of an emergency, I will still be able to arrive on time. \n Please let me know if there is anything else I can do to reassure you and the rest of the company that I greatly value my position on the sales team, and that I will not let the team down again. Thank you so much for your understanding. \n Sincerely, \n ABC", "Dear XYZ, \n Please accept this apology letter for the mistake I made handling the Brenton project. I apologize profusely for what happened, and you have my word it will never occur again. \n I misread my calendar and thought I had until the [date] of [month] to complete the project. Therefore, I thought I could delay the Brenton account and focus on other pressing matters. I do not offer this story as an excuse, but merely to tell you where I went wrong. It was a silly mistake on my end, and I will ensure I do better with all our clients. \n I accept full responsibility for this situation. If you feel the need to suspend my employment temporarily or take away my commission on the account, then please feel free to do so. I am also in the process of writing a detailed apology letter to the people at Brenton Industries to inform them of the situation. I understand at this point it is uncertain if they will continue doing business with us, and I will do everything in my power to keep them on as clients. \n I hope you can forgive me, and I hope to prove through my work that I only want the absolute best for all our clients. \n Sincerely, \n ABC", "[Date] \n Dear [Company name] employee: \n As we are all aware, the economy is posing challenges for everyone. We need to be financially responsible and proactive. To that end, I have asked the executive team to review all business goals, objectives and processes in order to find ways to decrease expenses, increase revenue and protect the future well-being of [Company name]. \n As a result of this analysis and in an effort to manage company assets conservatively during this economically challenging time, the executive team has come to a difficult but necessary conclusion. Effective [date], all exempt employees will receive a 5 percent reduction in their annual salary and all nonexempt employees will receive a 5 percent reduction in their hourly pay rate. In addition, all overtime work will cease and employees are expected to continue to work their regular full- or part-time schedule. \n This was an extremely tough decision, and we understand the impact this will have on you and your family. However, please know that we considered several other alternatives, and the choice we made is the best option at this time and will have the least impact on our employees overall. \n The executive team will continue to monitor [Company name] finances and reevaluate this decision each quarter this year. We believe the outcome from this measure will better position the company for a solid financial future. \n We appreciate all of your hard work, and we know we will have your support as we all strive for continued business success. Should you have any questions, please don not hesitate to speak with your manager or contact human resources. \n Sincerely, \n [Name] \n CEO/President"],
	 "context": [""]
         },
         {"tag": "Application_Letter",
         "patterns": ["Transfer Application Letter","Job Application Letter","College Application Letter", "Receptionist Application Letter", "Application Letter to Bank Manager","Overdue Payment Reminder Letter", "Scholarship Application Letter", "Internship Application Letter", "Graduate School Application Letter", "Librarian Application Letter"],
         "responses": ["Dear xyz,\n My name is xyz the parent of xyz a class xyz student in your school xyz. I wish to express my appreciation for the support you have given to my child for the xxx years he has schooled here. The staff have also been dedicated in their work to help the students do well in school.\n I hereby write to apply for a transfer of my child xyz admission number xxx. I have got a new job in xyz and I will relocate with my family by xyz. Since he is young and cannot be left alone in the city, I have decided to relocate him to a school near my new office.\n I have discussed this issue with the class teacher so that the arrangements for transfer can begin. Kindly find the dully filled transfer application form for your reference. Please grant a transfer to xyz so that we can finalize the travel arrangement by the latest xyz. I will highly appreciate your positive response.\n Thank you in advance for your consideration.","\n Dear xyz,\n I hereby write to apply for the xyz job opening with xyz re cently advertised on your career portal. I am motivated by the work of your organization in promoting accessibility of basic services in xyz. With my experience in project management and social services, I believe I will make an asset to your organization.\n Currently, I am working with xyz to support water and sanitation services in xyz. In my work for xxx years, I have supported over xxx projects to provide clean water to communities and offering sanitation awareness in  schools. My accomplishments have contributed to reducing sanitation-related health issues. In this position, I have demonstrated a passion for community services and promoting wellbeing.\n I have a degree in xyz, I have excellent communication, teamwork, organization, people-orientation, and leadership skills.  I am proficient in conducting surveys, research, and mobilizing resources. I believe my skills and experience will bring value to the work of your organization.\n I wish to welcome any opportunity for an interview                        . Please reach out through my cell xxx or email xyz.\n Your Truly,","Dear Sir/Madam,\n I came to know through one of your college students that you are conducting a special workshop for management students. I am studying name of course in name of institute and would like to attend it. I would like to know if there is any application to be submitted. If so, I request you to send me the application form to my address.\n The training programs you conduct are popular in the industry, and I want to take advantage of this opportunity. I understand that several big names in the industry are associated with the program. Lot many students belonging to various colleges are interested in participating in the training program and get benefitted. \n Please inform me through email, or you can contact me on my telephone number xxxx.\n Looking forward to hearing from you.", "Dear Mr/Ms name of the concerned person,\n I have seen your advertisement regarding the vacancy for the post of a receptionist in mention where you saw the advertisement dated give date of advertisement. I am interested to apply for the post.\n I have a graduate degree in mention subject and a diploma mention if any. Currently, I am working with name of company as a receptionist. Before this, I worked for give name for xxx years.\n As I have exposure in name of the industry industry for five years, I am well versed with the various formalities and procedures in the industry. If you find my profile suitable for this post, please contact me through email or telephone. My number is xxxxxxxx.\n Looking forward to hearing from you,","Dear xyz,\n I hereby write to apply for the xyz job opening with xyz recently advertised on your career portal. I am a graduate in xyz with xxx years of experience in business administration and financial management. After carefully reviewing the job requirements, I believe I can make an asset to your company.\nI am working for xxxx in the xyz department. For the past xxx years, I have engaged to customer service operations, responding to inquiries, processing bank transactions, recording banking details, and advising customers of business operations. In this position, I have demonstrated customer orientation, customer service, and communication skills. \n In my work experience, I have acquired skills in financial products, marketing, and business advisory. I have strong interpersonal skills, a high mathematical aptitude, and integrity. I believe that my skills and experience in the banking sector will make a great contribution to your bank. My understanding of trending banking technology and computer application will bring value to your service to customers.\n I hope to hear more about what are your expectations for this position. Kindly consider this application. \n Your Sincerely","Dear xyz,\n This letter is to formally notify you of a payment xxx days overdue on invoice number xxxx. The payment was overdue by date. You have been a good customer to our company and we would be disappointed to lose you.\nWe hereby request that you settle this payment at your earliest since our company xyz has a financial audit scheduled for xyz. Kindly make this payment at the latest xxxx. It is company policy to suspend doing business with companies with overdue payments for xxxx days. \n Please disregard this letter if you have made the payment and send support documents to our email  xyz. If otherwise, kindly release the payment immediately. Legal measures will be taken if this payment is due after xxxx days. I herewith enclose the invoice for your reference. Please do not hesitate to contact me if you have any doubts or inquiries. \n We hope that you will regard this matter with priority and make the overdue payment soon.\nThank you for your time and consideration.\n Yours Faithfully,","Dear xyz,\nHaving been accepted to name for the year fall term to pursue a Bachelor in Architecture, I am writing to express my desire to participate in the University Leadership Scholarship Program. For as long as I can remember, I have had a strong passion for architecture, my favorite Texas landmark being the pink granite edifice of the State Capitol. I am particularly excited by the opportunity to join a network of leaders who help to maintain UT Austin reputation as a world-leading public research university.\n My parents came to Texas as immigrants and have worked tirelessly in low paid jobs to provide for our family. If I am accepted to the program, I would be the first member of my family to benefit from a college education. My goal is to use my education to give back to the community. I want to specialize in designing affordable and environmentally sustainable housing. My passion for this field was inspired by my winning virtual city design for the National Future City competition, and I am all too aware of the impact of high housing costs and environmental destruction on underprivileged communities. \n Servant leadership is the philosophy I intend to follow as a program participant and alumni. I want society to benefit from my education and UT Austin to gain prestige as an institution providing innovation for the greater good. This scholarship would enable me to achieve these aims. In fact, my high school principal is an alumnus of the program. She has been a huge inspiration to me and many others, and I hope to follow her example should I be accepted.\n Please get in touch to arrange a meeting with me. I would love to tell you more about my upbringing and my desire to give back to my community through my further education.\n Best Regards,","Dear xyz,\n I was truly elated when my student project on cash flow improvement won the first prize in a local business club contest.xxx months after that, my solution was implemented at a construction company where it cut change orders processing time by xxx.\n I must admit it was no random win, though. I always had a strong desire to pursue a career as a leader in the xyz function. As I believe the only way of reaching this goal is through adopting a results-oriented attitude reflected in initiative and accountability, I used my time at university to develop these. I also gained hands-on quantitative, analytical, and problem-solving skills by completing such courses as:\n List of Courses \n I would love to demonstrate to you that my GPA of xxx does not just show my commitment to learning but also reflects my inherent passion for finances and propensity to grow among like-minded people.\n When xyz told me about an internship opportunity with xyz company, I knew this was an unmissable occasion for further growth, surrounded by outstanding xyz professionals.\n Could we schedule an appointment next week to discuss how I could contribute to the xyz Leadership Development Program and help your company find optimal solutions to its current business needs? \n Best Regards,","Dear xyz,\n With great pleasure, I would like to submit my application for the xyz In xyz program at the Department of xyz at xyz. After recently completing my xyz studies, this graduate program is the perfect path forward for me towards my goal of joining the xyz Institute.\nAs a graduate of xyz University xyz program, I was fortunate enough to be mentored by some of the greatest minds in these fields. Under their tutelage, I have honed my observational and analytical skills, as well as my knowledge of report-taking and reading measurements. I also had the life-changing experience of working with the preeminent polar explorer, ABC, on her summer quantifying the rapidly receding coastline of the xyz.\n Below my signature, you will find the application documents requested from me from the university website. If there is anything further from me you need, please give me a call, and I will get to it right away. Thank you very much for your time and consideration of my graduate school application \n Sincerely,","Dear xyz,\n Having been a librarian assistant at the xyz University Campus Library, I am quite fond of working amidst the stacks. When I saw your Indeed posting for a librarian at the xyz Library, it immediately excited me. Though I love assisting college students and other older visitors with their requests, I would love to use my natural enthusiasm for books to inspire the general public and younger children, which this job would allow me to do. \n As a library assistant, I have had the opportunity to chalk up several successes during my 2 and more years at the xyz University Campus Library. These include:\n Earned the Library Instruction Section Innovation Award in xxx year from the xxx.\n Digitized over xxx items from the backlog in the microfilm collection.\n Overhauled the Friends of xxx Library website, increasing readership by xx%.\n As I hope my award and achievements show, I love working around books. I enjoy helping others enjoy their books, and I take great pride in my friendly personality and helpful character. I know I would be a great fit at the xyz Library because I would bring these same traits with me.\n If you would kindly take the time, I would be happy to discuss in more detail how I can be the ideal candidate for the librarian job position.\n Sincerely, \n abc"],
         "context": [""]
        },
        {"tag": "Information_Request_Letter",
         "patterns": ["Request for Cheque Book Information Letter", "Letter Requesting Information of a Candidate", "Information of Product/Service Request Letter","Requesting Information for Wholesale Price List Letter","Credit Information Request Letter", "Meeting Information Request Letter", "Request for Salary Increment Information Letter", "Free Information Request Letter", " Informational Interview Request Letter", "Request for Price Quotation Information"],
         "responses": ["Dear xyz,\n This is to bring to your kind attention that I am account holder in your prestigious bank. My account no. is xxxx. I am totally satisfied with the services provided by your bank. Your employees are very much customer oriented. \n My old cheque book has just finished, and I would require a new one on an urgent basis to do my transactions. I would be very grateful to you if you could do the needful on an urgent basis and issue me a new cheque book. \n Your active action in this regard will be highly appreciated. \n Thanking you,\nYours sincerely,","Dear Name of the recipient, \n I would like to bring to your kind attention that Name of the candidate has applied in our organization for the post of the position of vacancy. As a company policy, we have asked for three references and have been given your name as first reference. I know that he has worked for your organization for time period in months or years, so you must be well aware of his strong and weak points. I would be really thankful to you if you could give us more information regarding his professional strengths as we have shortlisted him for the profile.\n Your early response in this regard will be highly appreciated. \n Thanking you, \n Yours Sincerely,","Dear Name of the recipient \n This is with regard to the launch of your new product xxx in the market. I would like to congratulate you and wish you luck in this endeavour. The product has garnered immense support from the media. We are also enthusiastic to purchase it.\n We are enthusiastic to purchase it. We would be thankful if you could mail us the detailed information booklet of the product. We are in the process of taking a decision. It would help if you could do the needful at the earliest. \n Thank you. \n Yours sincerely,","Dear Name of the recipient \n We saw your advertisement in name of the source dated date on which the advertisement was displayed and we are interested in doing business with your company. \n I am writing on behalf of our company, name of the company offering a range of products name of the products\n We would like to know the list of the products you would be offering along with the prices for the same. Also, we would appreciate if you send the terms and conditions along with those above. \n We are looking forward to your response. Thank You. \n Yours faithfully,","Dear xyz, \n This is to bring to your kind attention that I hold an account in your reputed organisation. My account no. is xxxxxx. I am totally satisfied with your services and security policies. I would be grateful to you if you could provide me details on my latest transactions and give me up to date credit report. I would need the same for tax purposes. \n I would appreciate it if you keep the details confidential. I also request you to add my contact details for promotional offers of yours. Please feel free to contact me if you need any further information. \n Thanking you, \n Yours truly","Dear Name of the recipient \n Good day! \n My name is xyz and I am a/an xyz from xyz. I have been following your works for the past xxx years and I have been impressed by your dedication and your understanding of the whole spectrum of the media industry. I am writing to ask for a fraction of your time to meet me for an interview. I would just like to ask for your insights and suggestions on where I could improve my skills as a xyz Professional. \n I am a journalism graduate from XYZ University. I have been impressed by your works in numerous magazines xyz and xyz. I happen to be engrossed in the same field of interests and it would be great to hear your ideas on how to best deliver these topics to the masses. \n I would greatly appreciate the opportunity to meet you and get your feedback on my writing ability along with how I can best use it in the field that I have chosen. I will bring my portfolio with me and I will call your office to set up a convenient time. Thank you very much as I look forward to meeting you. \n Thanking you, \n Yours truly","Dear Name of the recipient \n I would like to present my request for a salary increment. I have been working in your organization for the last xxx years, and I have always performed my duty wholeheartedly and never given cause for complaint. In the present economic circumstances, my salary is insufficient to support myself and my family, and I sincerely hope that you will favourably consider my request for a salary increment. \n Thank you very much for your time and consideration. \n Thanking you, \n Yours truly","Dear Name of the recipient \n I am writing to inquire about the product your company has recently launched. Our company, xyz Company, which is Nature of Business, is interested in purchasing computers for our newly built office. \n We have learned from an internet ad that you have launched a new model of computers which seems to suit our company’s needs. However, it would be great to know about the product more. Therefore, I would like to ask if you could send us a product catalog along with a reasonable price offer for bulk purchases. \n Thanking you, \n Yours truly","Dear Name of the recipient \n xyz, the Manager of xyz Company suggested that I contact you given my interest in exploring a career incorporation law. I would appreciate the opportunity to spend xxx minutes with you for an informational interview to help guide my curricular and career decisions. I have enclosed in this letter my resume to give you a sense of my background. \n Thank you so much for your consideration. I admire your work so much and following your works, I could see that you have done what I hope to do: graduate from xyz University and establishing a law firm that is focused on helping different corporations. Any guidance you may provide me would be greatly appreciated.\n Thanking you, \n Yours truly","Dear Name of the recipient \n We are writing to inform you that we are interested on the goods that you are offering and we would like to ask for a price quote for the following items: \n List of All Items \n We are also asking if you can give us the best possible price for such goods. We are looking at a long term partnership since we will be permanently using those goods for our products and services. \n Thanking you,\n Yours truly"],
         "context": [""]
         },
         {"tag": "Job_Search_and_Networking_Letters",
	  "patterns": ["Quick follow up Email for conference ", "Career Fair internship follow up Email ", "Job assistant position", "Part Time Position ", "Office Assistant ", "Conference meeting for an appointment", "moving location for job role", "networking Email", "recommendation Email for job role", "Congratulation and wishing  Email", "Hey", "Hola", "Hello", "Good day", "Hi"],
	  "responses": ["Hi ABC, \n I hope you are doing great. We met at the APM Conference last month, where we talked about your career at Facebook. I am currently at  resume Worded working as a business analyst. \n I have been figuring out my next caree move, and product management seems like a great fit for my experience. Facebook is a dream company for me, and if it is okay with you, I would love to ask you a few questions about your experience there and if you also think PM is the right fit for me. \n Do you have time for a quick coffee next week I can come to your office or wherever is most convenient for you. I would really appreciate it.\n Best, \n XYZ ", "Hi ABC, \n Thank you so much for taking the time to present at the Resume Worded Career Fair and for speaking with me for a few minutes afterward. It was great to have the opportunity to hear more about Resume Worded and its internship program. \n If it is OK with you, could we stay in contact if I have any questions? \n Thanks, \n XYZ", "Dear ABC \n I would like to  express my deep interest in entering a position as an editorial assistant for your publishing company.\n As a recent graduate with writing, editing, and administrative experience, I believe I am a strong candidate for a position at the 123 Publishing Company.\n You specify that you are looking for someone with strong writing skills. As an English major at DEF University, a writing tutor, and an editorial intern for both a government magazine and a college marketing office, I have become a skilled writer with a variety of publication experience. \n My maturity, practical experience, attention to detail, and eagerness to enter the publishing business will make me an excellent editorial assistant. I would love to begin my career with your company and am confident that I would be a beneficial addition to the 123 Publishing Company.\n I have attached my resume to this email and will call within the next week to see if we might arrange a time to speak together.\n Thank you   so much for your time and consideration. \n Sincerely, \n XYZ", "Dear ABC ,\n I am interested in the part time sales associate position at QSD Company. I read the posting on Monster.com with interest, and I feel that my experience would be valuable to your firm. My communication skills and attention to detail are assets that I have been able to utilize in my previous sales positions.\n I have extensive retail experience, having worked at small boutiques as well as large department stores. In these jobs, I was often praised for my attention to detail. I was particularly skilled at spotting items that were out of place, and quickly returning them to their appropriate locations in the store.\n I also have strong communication skills. I am able to interact with clients in a friendly, approachable manner. In my last position, I interacted with over 50 clients daily. I was named Employee of the Month for three months in a row, and was recognized for my contribution to a 10 percent yearly increase in sales in my department. \n I would appreciate the opportunity  to meet with you regarding this position. I am available flexible hours, and I believe that you would find me to be an asset to your company.\n Sincerely, \n XYZ", "Dear ABC,\n I am interested in applying for the office assistant position that was listed on CareerBuilder. \n I have experience in scheduling appointments and communicating with clients, and I am familiar with a variety of phone systems. My communication skills are excellent I have been praised for my ability to communicate with clients effectively on the phone, in person, and over email. \n I also have training on a variety of software programs and systems, including Microsoft Excel, Adobe InDesign, DocuSign, and more. I recently led a workshop for office staff at my previous job on how to effectively use SharePoint. I am a fast learner who is skilled at mastering computer software. \n My schedule is flexible, and I would be available to work at your convenience. I hope to schedule an  interview at a mutually convenient time. I look forward to  speaking with you. \n Thank you for your consideration.\n Sincerely, \n XYZ", "Hi Patrick, \n You and I met at the APM Conference last year, where we spoke about your role at Facebook. My apologies for not keeping in touch after the conference! I hope it is okay to reach out today. \n I have been figuring out my next career move, and product management seems like a great fit for my experience. Facebook a dream company for me, and if it is okay with you, I would love to ask you a few questions about your experience there and if you also think PM is the right fit for me. \n Do you have time for a 10-15 minute phone call next week I would really appreciate it. \n Best, \n XYZ ", "Hi ABC, \n This is ABC. You and I met at event and talked briefly about subject. I apologize for falling out of touch and hope you have been well. \n My family and I are planning a move to city, and I would love to hear your thoughts on the area since I see you are living there now. What is your experience been like Do you have any advice for a newcomer  \n Warm regards, \n XYZ ", "Hey ABC, \n It is been a while It looks like you have been doing some exciting things since we worked together at QSD. How is your current job going \n I am sure things are busy, but is there a day soon when you might be free to catch up over lunch or coffee? It would be great to reconnect. I hope you’ve been well. \n Take care, \n XYZ", "Hi ABC, \n I hope this email finds you well. I wanted to reach out to you because I am looking for a new job in desired industry. I remember that you used to work for QSD, which is somewhere I have had my eye on for a while. Are you still in touch with anyone there If so, would you be willing to introduce me \n If you know of any other job opportunities, I would love to hear about those as well. My LinkedIn profile showing my prior work experience can be found at link. Thanks in advance for your help and please let me know if there is anything I can do for you in return \n Best, \n XYZ ", "Hey ABC, \n It is been a while and I just wanted to say a quick hello. Hope you and your family are doing well.\n Congratulations on new job, life event, etc, by the way I saw your post on Linkedin how exciting How has that been going? \n All the best, \n XYZ"],
		"context": [""]
        },
        {"tag": "Job_Invitation_Email",
         "patterns": ["Casual Interview","Cold Candidate Interview","Formal Interview","Phone Interview","Video Interview"],
         "responses": ["Hello abc, \n Thank you for applying to the JOB TITLE position at COMPANY NAME.We have reviewed your application materials carefully, and we are excited to invite you to interview for the role. \n Your interview will be conducted and last roughly 20. to 25 mins You will be speaking with XYZ, our XYZ JOB TITLE here at COMPANY NAME.Please let us know when you are available during the following times \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE TIME, TIME ZONE \n Thanks again for your interest in joining the COMPANY NAME team. We are looking forward to speaking with you. \n Best,\n XYZ \n  EMAIL SIGNATURE", "Hello abc,\n I came across your profile on WEBSITE or SOURCE and was interested in your recent work in the specific FIELD.I akilom a recruiter at COMPANY NAME, and we are looking for a JOB TITLE that I think you would be a good fit for.I would love to hear more about you and tell you about the role. Are you free this week for a quick TT minute call? I am available at the following times \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE TIME, TIME ZONE \n Please let me know if any of these times work for you.\n Looking forward to hearing from you.\n Best,\n XYZ \n EMAIL SIGNATURE", "Hello abc, \n Thank you for your application to the JOB TITLE role at COMPANY NAME.\n We would like to invite you to interview for the role with XYZ.The interview will last 30 to 45 mins in total.Please reply to this email directly with your availability during the following date and time options \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n We look forward to speaking with you.\n Sincerely,\n XYZ \n EMAIL SIGNATURE", "Hello abc,\n Thank you for applying to the JOB TITLE position at COMPANY NAME.\n After reviewing your application, we are excited to move forward with the interview process.\n We would like to schedule a TT to TT min phone call with XYZ. Below are some date and time options \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n Please reply directly to this email and let me know if you are available at any of the above times. From there, I will coordinate with XYZ and send you an email with a calendar invitation to confirm the date and time.\n Best,\n XYZ \n EMAIL SIGNATURE", "Hello abc, \n Thank you for applying to the JOB TITLE position at COMPANY NAME.\n After reviewing your application, we would like to invite you to interview with XYZ.So we can get to know you better, the interview will be conducted over video using VIDEO CONFERENCING PLATFORM and last about 45 to 60 mins in total.We want you to be able to plan accordingly, so we have provided a list of date and time options over the next week. Please take a look and let us know which date is best for you. \n DAY, DATE  TIME, TIME ZONE \n DAY, DATE  TIME, TIME ZONE \n  DAY, DATE  TIME, TIME ZONE \n We are looking forward to continuing the conversation.\n Best, XYZ \n  EMAIL SIGNATURE"],
            "context": [""]
        },
        {"tag": "Job_Offer_Letter_Email",
         "patterns": ["Formal Job Offer Letter","Developer Job Offer Letter","Internal Promotion Offer Letter","Part time to Full time Offer Letter","Sales Job Offer Letter"],
         "responses": ["Position \n Job title \n Your title will be Job title, and you will report to the Company Manager job title.\n Working schedule \n This is a full time or part time position requiring approximately example 40 hours. Your regular weekly schedule will be example Monday to Friday 09 am to 5 pm. \n Employment Relationship\n Employment with the Company is for no specific period of time. Your employment with the Company will be at will meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations that may have been made to you are superseded by this letter agreement. This is the full and complete agreement between you and the Company on this term. Although your job duties, title, compensation and benefits, as well as the Company personnel policies and procedures, may change from time to time, the at will nature of your employment may only be changed in an express written agreement siged by you and a duly authorized officer of the Company \n  Cash Compensation \n Salary \n The Company will pay you a starting salary at the rate of amount annual salary per year, payable in accordance with the Company standard payroll schedule, beginning start day and you will receive your first paycheck on date. This salary will be subject to adjustment pursuant to the Company employee compensation policies. \n Tax withholding \n All forms of compensation referred to in this letter agreement are subject to reduction to reflect applicable withholding and payroll taxes and other deductions required by law. \n Tax advice \n You are encouraged to obtain your own tax advice regarding your compensation from the Company. You agree that the Company does not have a duty to design its compensation policies in a manner that minimizes your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation. \n  Bonus  potential \n In addition, you will be eligible to be considered for an incentive bonus for each fiscal year of the Company. The bonus will be awarded based on objective or subjective criteria established by the Company Chief Executive Officer and approved by the Company Board of Directors. Your target bonus will be equal to percent of your annual base salary. Any bonus for the fiscal year in which your employment begins will be prorated, based on the number of days you are employed by the Company during that fiscal year. Any bonus for a fiscal year will be paid within few months after the close of that fiscal year, but only if you are still employed by the Company at the time of payment. The determinations of the Company Board of Directors with respect to your bonus will be final and binding. \n  Employee benefits \n As a regular employee of the Company, you will be eligible to participate in a number of Company sponsored benefits. \n The Company offers a comprehensive employee benefits program, including \n Vacation policy \n You will be eligible for number of days of paid vacation leave per year. Paid time off is additional to sick days, bank holidays and days that the company does not operate.\n Private health and dental insurance plan.\n As all Company employees, you will be eligible for the private health and dental insurance plan we provide. Specific terms and conditions may change upon vendor decision. \n Stock Options \n Subject to the approval of the Company Board of Directors or its Compensation Committee, and following the adoption by the Company of an equity incentive plan, you will be granted an option to purchase shares of the Common Stock of the Company or of its parent. The exercise price per share of the Option will be determined by the Board of Directors or the Compensation Committee when the Option is granted. The Option will be subject to the terms and conditions applicable to options granted under the Company Stock Plan, as described in the Plan and the applicable Stock Option Agreement. You will vest in TWENTY FIVE percent of the Option shares after 12 months of continuous service, and the balance will vest in equal monthly installments over the next 36 months of continuous service, as described in the applicable Stock Option Agreement. \n Privacy and Confidentiality Agreements\n Privacy Agreement \n You are required to observe and uphold all of the Company privacy policies and procedures as implemented or varied from time to time. Collection, storage, access to and dissemination of employee personal information will be in accordance with privacy legislation. \n Conflict of Interest policy\n While you are employed at this Company, you will not engage in any other employment, consulting or other business activity whether full time or part time that would create a conflict of interest with the Company. By signing this letter of agreement, you confirm that you have no contractual commitments or other legal obligations that would prohibit you from performing your duties for the Company. \n Proprietary Information and Inventions Agreement.\n Like all Company employees, you will be required, as a condition of your employment with the Company, to sign the Company standard Proprietary Information and Inventions Agreement. \n  Termination Conditions\n The Company reserves the right to terminate employment of any employee for just cause at any time without notice and without payment in lieu of notice. The Company will be entitled to terminate your employment for any reason other than for just cause, upon providing to you such minimum notice as required by law. \n  Interpretation, Amendment and Enforcement \n This letter agreement supersedes and replaces any prior agreements, representations or understandings between you and the Company and constitute the complete agreement between you and the Company regarding the subject matter set forth herein. This letter agreement may not be amended or modified, except by an express written agreement signed by both you and a duly authorized officer of the Company. \n You may indicate your agreement with these terms and accept this offer by signing and dating this agreement by date. Upon your acceptance of this employment offer, Company name will provide you with the necessary paperwork and instructions.\n Sincerely,\n XYZ","Position \n Job Title \n Your title will be Job title, and you will report to the Company Manager job title. \n Work Schedule \n This is a full time or part time position requiring approximately example 40 hours per week. Your regular weekly schedule will be example Monday to Friday 9 am to 5 pm.For remote work options and flexible hours, see the Benefits section. \n Employment Relationship\n Employment with the Company is for no specific period of time. Your employment with the Company. Any contrary representations that may have been made to you are superseded by this letter agreement. This is the full and complete agreement between you and the Company on this term. Although your job duties, title, compensation and benefits, as well as the Company personnel policies and procedures, may change from time to time, the at will nature of your employment may only be changed in an express written agreement signed by you and a duly authorized officer of the Company. \n Cash Compensation \n Salary \n The Company will pay you a starting salary at the rate of amount annual salary per year, payable in accordance with the Company standard payroll schedule, beginning and you will receive your first pay on date. This salary will be subject to adjustment pursuant to the Company employee compensation policies in effect at the time.\n Tax Withholding\n All forms of compensation referred to in this letter agreement are subject to reduction to reflect applicable withholding and payroll taxes and other deductions required by law. \n Tax Advice \n You are encouraged to obtain your own tax advice regarding your compensation from the Company. You agree that the Company does not have a duty to design its compensation policies in a manner that minimizes your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation. \n Bonus potential \n In addition, you will be eligible to be considered for an incentive bonus for each fiscal year of the Company. The bonus will be awarded based on objective or subjective criteria established by the Company Chief Executive Officer and approved by the Company Board of Directors. Your target bonus will be equal to percent of your annual base salary. Any bonus for the fiscal year in which your employment begins will be prorated, based on the number of days you are employed by the Company during that fiscal year. Any bonus for a fiscal year will be paid within few months after the close of that fiscal year, but only if you are still employed by the Company at the time of payment. The determinations of the Company Board of Directors with respect to your bonus will be final and binding. \n  Employee benefits \n As a regular employee of the Company, you will be eligible to participate in a number of Company-sponsored benefits.\n The Company offers a comprehensive employee benefits program, including \n Flexible Hours \n You will be eligible for number of work from home days per week, month or year.You can also occasionally adjust your daily working schedule upon manager approval, should you have any personal commitments. \n Vacation Policy \n You will be eligible for days of paid vacation leave per year. Paid time off is additional to sick days, bank holidays and days that the company does not operate. \n Health and Dental Insurance \n As all Company employees, you will be eligible for the health and dental insurance plan we provide. Specific terms and conditions may change upon vendor decision. \n Remote Work \n You will be eligible for number of days of remote work per year, upon manager approval. Mention any limitations, example You can request to work remotely after you have completed three months of employment with our company. \n Training \n As part of our professional development initiative for all employees, you will be eligible for an annual training budget. You can use this for educational materials, including books, subscriptions to online courses, tickets to conferences and workshops or other resources, upon managerial approval. You’re also eligible for tuition fee reimbursement, upon HR department approval. \n Stock Options \n Subject to the approval of the Company Board of Directors or its Compensation Committee, and following the adoption by the Company of an equity incentive plan, you will be granted an option to purchase shares of the Common Stock of the Company or of its parent.  The exercise price per share of the Option will be determined by the Board of Directors or the Compensation Committee when the Option is granted. The Option will be subject to the terms and conditions applicable to options granted under the Company Stock Plan, as described in the Plan and the applicable Stock Option Agreement. You will be able to vest in TT percent of the Option shares after TT months of continuous service, and the balance will vest in equal monthly installments over the next 36 months of continuous service, as described in the applicable Stock Option Agreement. \n  Privacy and confidentiality agreements\n Privacy Agreement\n You are required to observe and uphold all of the Company privacy policies and procedures as implemented or varied from time to time. Collection, storage, access to and dissemination of employee personal information will be in accordance with privacy legislation. \n Conflict of Interest Policy \n While you are employed at this Company, you will not engage in any other employment, consulting or other business activity whether full time or part time that would create a conflict of interest with the Company example freelance coding work for our competitor.By signing this letter of agreement, you confirm that you have no contractual commitments or other legal obligations that would prohibit you from performing your duties for the Company. \n Proprietary Information and Inventions Agreement \n Like all Company employees, you will be required, as a condition of your employment with the Company, to sign the Company standard Proprietary Information and Inventions Agreement. \n Termination conditions\n The Company reserves the right to terminate employment of any employee for just cause at any time without notice and without payment in lieu of notice.The Company will be entitled to terminate your employment for any reason other than for just cause,upon providing to you such minimum notice as required by law. \n Interpretation, Amendment and Enforcement \n This letter agreement supersedes and replaces any prior agreements, representations or understandings between you and the Company and constitute the complete agreement between you and the Company regarding the subject matter set forth herein. This letter agreement may not be amended or modified, except by an express written agreement signed by both you and a duly authorized officer of the Company. \n You may indicate your agreement with these terms and accept this offer by signing and dating this agreement by date. Upon your acceptance of this employment offer, Company name will provide you with the necessary paperwork and instructions.\n Sincerely,\n XYZ \n Signatures  \n Company Representative Sign \n  Company Representative \n  Date \n Applicant Sign  \n Applicant  \n Date","Congratulations on your new role.Your new employment contract. \n Dear abc,\n As discussed, we are happy to officially promote you to Senior Account Manager or Team Leaderas. \n Attached you will find your updated contract that contains your new employment terms along with your compensation package and benefits. Please review and come by the HR office to sign it or send back signed via email until date. Feel free to reach out to me, should you have any questions. \n We appreciate your hard work and commitment to the Company nameteam for the past two years. We are all looking forward to seeing you achieve great things in your new role. \n Congratulations \n Best,\n XYZ", "Dear abc,\n We are excited to announce that we are offering to extend your employment status from part time to full time, as of date.\n If you accept this offer, please find the terms and conditions of your new employment contract below \n Position example You will be working as a Job title and reporting to the example Marketing department supervisor.\n Working hours example Monday to Friday 9 am to 5 pm, with a 20 minute break per day \n Compensation example Your annual gross salary will be X \n Bonus \n   Benefits example As a full time employee, you will be eligible for the benefits that Company name offers. These benefits include \n Private health and dental insurance plan \n days of paid vacation leave per year \n Educational materials and expenses, subject to management approval. \n You will also be eligible for any additional employee benefits that the company may provide in the future.\n To accept, sign and date this full time offer letter as indicated below and email it back to us by date. Feel free to contact the HR department or your supervisor, if you have any questions. \n  Sincerely,\n abc \n Signatures \n Company Representative Sign \n Company Representative \n  Date \n Employee Sign  \n Employee  \n Date", "Position \n Job Title \n Your title will be Job title, and you will report to the Company Manager job title. \n Working Schedule \n This is a full time or part time position requiring approximately example 40 hours per week. You will be working five days per week, eight hours per day in rotating shifts. These shifts can be 9am to 5pm and 1pm to 9pm, from Monday to Saturday.The shifts will be scheduled on a monthly basis. \n Employment Relationship \n Employment with the Company is for no specific period of time. Your employment with the Company will be at will meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations that may have been made to you are superseded by this letter agreement. This is the full and complete agreement between you and the Company on this term. Although your job duties, title,compensation and benefits, as well as the Company personnel policies and procedures, may change from time to time, the at will nature of your employment may only be changed in an express written agreement signed by you and a duly authorized officer of the Company. \n Cash Compensation\n Salary \n The Company will pay you a starting salary at the rate of amount annual salary per year, payable in accordance with the Company standard payroll schedule, beginning and you will receive your first pay be subject to adjustment pursuant to the Company employee compensation policies in effect at the time.\n Tax Withholding \n All forms of compensation referred to in this letter agreement are subject to reduction to reflect applicable withholding and payroll taxes and other deductions required by law. \n Tax Advice \n You are encouraged to obtain your own tax advice regarding your compensation from the Company. You agree that the Company does not have a duty to design its compensation policies in a manner that minimizes your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation. \n Commission potential \n In addition to your base salary, you will receive percent commission on individual sales. The amount of the commission will be calculated on a example monthly or quarterly based and will be added to payroll. \n You will also be eligible for an overachievement commission when you exceed sales quotas. In this case, your commission will be calculated based on an accelerated rate of percent of your annual base salary. \n Bonus options\n You will be eligible for a Standard bonus for each fiscal year of the Company. The bonus will be awarded based on annual Sales department targets. These targets will be established by the Company Chief Executive Officer and approved by the Company Board of Directors and or the VP of Sales. Your bonus will be equal to percent of your annual base salary. Any bonus for the fiscal year in which your employment begins will be prorated, based on the number of days you are employed by the Company during that fiscal year. Any bonus for a fiscal year will be paid within few months after the close of that fiscal year, but only if you are still employed by the Company at the time of payment.The determinations of the Company Board of Directors with respect to your bonus will be final and binding. \n Employee Benefits\n As a regular employee of the Company, you will be eligible to participate in a number of Company sponsored benefits. \n The Company offers a comprehensive employee benefits program, including \n Health and dental insurance \n As all Company employees, you will be eligible for the health and dental insurance plans we offer. Specific terms and conditions may change upon vendor decision. \n Vacation policy \n You will be eligible for number of days of paid vacation leave per year. Paid time off is additional to sick days, bank holidays and days that the company does not operate.  \n Training \n You will be eligible for an annual training budget, as part of our professional development initiative for all employees. This can be used for educational materials, like books or other resources, subscriptions to online courses or tickets to conferences and workshops, upon manager approval. \n Travel expense reimbursement \n You will receive full reimbursement for travel expenses related to events you participate in as part of your job, upon manager approval. These expenses include transportation, lodging and meals. The exact terms of travel expense reimbursements are described in the Company travel policy. \n Stock Options\n Subject to the approval of the Company Board of Directors or its Compensation Committee, and following the adoption by the Company of an equity incentive plan, you will be granted an option to purchase shares of the Common Stock of the Company or of its parent.  The exercise price per share of the Option will be determined by the Board of Directors or the Compensation Committee when the Option is granted. The Option will be subject to the terms and conditions applicable to options granted under the Company Stock Plan, as described in the Plan and the applicable Stock Option Agreement. You will vest in 25 percent of the Option shares after 12 months of continuous service, and the balance will vest in equal monthly installments over the next 36 months of continuous service, as described in the applicable Stock Option Agreement. \n  Privacy and confidentiality agreements \n Privacy Agreement \n You are required to observe and uphold all of the Company privacy policies and procedures as implemented or varied from time to time. Collection, storage, access to and dissemination of employee personal information will be in accordance with privacy legislation. \n Conflict of Interest Policy \n While you are employed at this Company, you will not engage in any other employment, consulting or other business activity whether full time or part time that would create a conflict of interest with the Company. By signing this letter of agreement, you confirm that you have no contractual commitments or other legal obligations that would prohibit you from performing your duties for the Company. \n Proprietary Information and Inventions Agreement \n Like all Company employees, you will be required, as a condition of your employment with the Company, to sign the Company standard Proprietary Information and Inventions Agreement. \n Termination conditions \n The Company reserves the right to terminate employment of any employee for just cause at any time without notice and without payment in lieu of notice.  The Company will be entitled to terminate your employment for any reason other than for just cause, upon providing to you such minimum notice as required by law. \n Interpretation, Amendment and Enforcement \n This letter agreement supersedes and replaces any prior agreements, representations or understandings between you and the Company and constitute the complete agreement between you and the Company regarding the subject matter set forth herein. This letter agreement may not be amended or modified, except by an express written agreement signed by both you and a duly authorized officer of the Company. \n You may indicate your agreement with these terms and accept this offer by signing and dating this agreement by date. Upon your acceptance of this employment offer, Company name will provide you with the necessary paperwork and instructions.\n Sincerely,\n XYZ \n Signatures \n Company Representative sign \n Date \n Applicant Sign \n  Date"],
            "context": [""]
            }
]
}
        
        
 